sphere/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.3.0                                 |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
	(-1   -1    1)
	(-1   -0.3  1)
	(-1    0.3  1)
	(-1    1    1)
	(-0.3 -1    1)
	(-0.3 -0.3  1)
	(-0.3  0.3  1)
	(-0.3  1    1)
	( 1.8 -1    1)
	( 1.8 -0.3  1)
	( 1.8  0.3  1)
	( 1.8  1    1)
	( 2.5 -1    1)
	( 2.5 -0.3  1)
	( 2.5  0.3  1)
	( 2.5  1    1)

	(-1   -1    0.3)
	(-1   -0.3  0.3)
	(-1    0.3  0.3)
	(-1    1    0.3)
	(-0.3 -1    0.3)
	(-0.3 -0.3  0.3)
	(-0.3  0.3  0.3)
	(-0.3  1    0.3)
	( 1.8 -1    0.3)
	( 1.8 -0.3  0.3)
	( 1.8  0.3  0.3)
	( 1.8  1    0.3)
	( 2.5 -1    0.3)
	( 2.5 -0.3  0.3)
	( 2.5  0.3  0.3)
	( 2.5  1    0.3)

	(-1   -1   -0.3)
	(-1   -0.3 -0.3)
	(-1    0.3 -0.3)
	(-1    1   -0.3)
	(-0.3 -1   -0.3)
	(-0.3 -0.3 -0.3)
	(-0.3  0.3 -0.3)
	(-0.3  1   -0.3)
	( 1.8 -1   -0.3)
	( 1.8 -0.3 -0.3)
	( 1.8  0.3 -0.3)
	( 1.8  1   -0.3)
	( 2.5 -1   -0.3)
	( 2.5 -0.3 -0.3)
	( 2.5  0.3 -0.3)
	( 2.5  1   -0.3)

	(-1   -1   -1)
	(-1   -0.3 -1)
	(-1    0.3 -1)
	(-1    1   -1)
	(-0.3 -1   -1)
	(-0.3 -0.3 -1)
	(-0.3  0.3 -1)
	(-0.3  1   -1)
	( 1.8 -1   -1)
	( 1.8 -0.3 -1)
	( 1.8  0.3 -1)
	( 1.8  1   -1)
	( 2.5 -1   -1)
	( 2.5 -0.3 -1)
	( 2.5  0.3 -1)
	( 2.5  1   -1)
);
blocks
(

hex ( 16 20 21 17 0 4 5 1 )       ( 25  25 25)  simpleGrading (0.05 0.05 20)
hex ( 17 21 22 18 1 5 6 2 )       ( 25 120 25)  simpleGrading (0.05 1    20)
hex ( 18 22 23 19 2 6 7 3 )       ( 25  25 25)  simpleGrading (0.05 20.0 20)
hex ( 20 24 25 21 4 8 9 5 )       (420  25 25)  simpleGrading (1    0.05 20)
hex ( 21 25 26 22 5 9 10 6 )      (420 120 25)  simpleGrading (1    1    20)
hex ( 22 26 27 23 6 10 11 7 )     (420  25 25)  simpleGrading (1    20.0 20)
hex ( 24 28 29 25 8 12 13 9 )     ( 25  25 25)  simpleGrading (20.  0.05 20)
hex ( 25 29 30 26 9 13 14 10 )    ( 25 120 25)  simpleGrading (20.  1    20)
hex ( 26 30 31 27 10 14 15 11)    ( 25  25 25)  simpleGrading (20.  20.0 20)

hex ( 32 36 37 33 16 20 21 17 )   ( 25  25 120) simpleGrading (0.05 0.05 1)
hex ( 33 37 38 34 17 21 22 18 )   ( 25 120 120) simpleGrading (0.05 1    1)
hex ( 34 38 39 35 18 22 23 19 )   ( 25  25 120) simpleGrading (0.05 20.0 1)
hex ( 36 40 41 37 20 24 25 21 )   (420  25 120) simpleGrading (1    0.05 1)
hex ( 37 41 42 38 21 25 26 22 )   (420 120 120) simpleGrading (1    1    1)
hex ( 38 42 43 39 22 26 27 23 )   (420  25 120) simpleGrading (1    20.0 1)
hex ( 40 44 45 41 24 28 29 25 )   ( 25  25 120) simpleGrading (20.  0.05 1)
hex ( 41 45 46 42 25 29 30 26 )   ( 25 120 120) simpleGrading (20.  1    1)
hex ( 42 46 47 43 26 30 31 27 )   ( 25  25 120) simpleGrading (20.  20.0 1)

hex ( 48 52 53 49 32 36 37 33 )   ( 25  25 25)  simpleGrading (0.05 0.05 0.05)
hex ( 49 53 54 50 33 37 38 34 )   ( 25 120 25)  simpleGrading (0.05 1    0.05)
hex ( 50 54 55 51 34 38 39 35 )   ( 25  25 25)  simpleGrading (0.05 20.0 0.05)
hex ( 52 56 57 53 36 40 41 37 )   (420  25 25)  simpleGrading (1    0.05 0.05)
hex ( 53 57 58 54 37 41 42 38 )   (420 120 25)  simpleGrading (1    1    0.05)
hex ( 54 58 59 55 38 42 43 39 )   (420  25 25)  simpleGrading (1    20.0 0.05)
hex ( 56 60 61 57 40 44 45 41 )   ( 25  25 25)  simpleGrading (20.  0.05 0.05)
hex ( 57 61 62 58 41 45 46 42 )   ( 25 120 25)  simpleGrading (20.  1    0.05)
hex ( 58 62 63 59 42 46 47 43 )   ( 25  25 25)  simpleGrading (20.  20.0 0.05)
);
edges();

boundary
(
front
{
	type empty;
	faces (
		( 0 4 5 1 )
		( 1 5 6 2 )
		( 2 6 7 3 )
		( 4 8 9 5 )
		( 5 9 10 6 )
		( 6 10 11 7 )
		( 8 12 13 9 )
		( 9 13 14 10 )
		( 10 14 15 11 )
	);
}
back
{
	type empty;
	faces (
    ( 48 52 53 49 )
    ( 49 53 54 50 )
    ( 50 54 55 51 )
    ( 52 56 57 53 )
    ( 53 57 58 54 )
    ( 54 58 59 55 )
    ( 56 60 61 57 )
    ( 57 61 62 58 )
    ( 58 62 63 59 )
	);
}
bottom
{
	/* type cyclic; */
    /* neighbourPatch side2; */
    type wall;
	faces (
		( 16 20 4 0 )
		( 20 24 8 4 )
		( 24 28 12 8 )
    ( 32 36 20 16 )
    ( 36 40 24 20 )
    ( 40 44 28 24 )
    ( 48 52 36 32 )
    ( 52 56 40 36 )
    ( 56 60 44 40 )
	);
}
top
{
	/* type cyclic; */
    /* neighbourPatch side1; */
    type wall;
	faces (
		( 19 23 7 3 )
		( 23 27 11 7 )
		( 27 31 15 11 )
    ( 35 39 23 19 )
    ( 39 43 27 23 )
    ( 43 47 31 27 )
    ( 51 55 39 35 )
    ( 55 59 43 39 )
    ( 59 63 47 43 )
	);
}
outlet
{
	type wall;
	faces (
		( 28 29 13 12 )
		( 29 30 14 13 )
		( 30 31 15 14 )
    ( 44 45 29 28 )
    ( 45 46 30 29 )
    ( 46 47 31 30 )
    ( 60 61 45 44 )
    ( 61 62 46 45 )
    ( 62 63 47 46 )
	);
}
inlet
{
	type wall;
	faces (
		( 16 17 1 0 )
		( 17 18 2 1 )
		( 18 19 3 2 )
    ( 32 33 17 16 )
    ( 33 34 18 17 )
    ( 34 35 19 18 )
    ( 48 49 33 32 )
    ( 49 50 34 33 )
    ( 50 51 35 34 )
	);
}
);
mergePatchPairs
(
);

